# Brewfile — fearful (Maximiliano Falicoff)
# Generated from nix-darwin config, April 2026
# Usage: brew bundle --file=Brewfile

# ─────────────────────────────────────────────
# CLI TOOLS — Language Runtimes
# ─────────────────────────────────────────────
brew "oven-sh/bun/bun"

# ─────────────────────────────────────────────
# CLI TOOLS — Infrastructure & Cloud
# ─────────────────────────────────────────────
brew "terraform"
brew "azure-cli"

# ─────────────────────────────────────────────
# CLI TOOLS — Developer Tools
# ─────────────────────────────────────────────
brew "git-delta"        # beautiful diffs (used by git as pager)
brew "git-lfs"
brew "git-filter-repo"
brew "lazygit"          # TUI git client
brew "lazydocker"       # Docker TUI
brew "just"             # command runner
brew "jq"               # JSON processor
brew "direnv"           # per-directory env vars
brew "age"              # modern file encryption
brew "sops"             # secrets manager
brew "opencode"         # AI coding agent
cask "claude-code" 
brew "chezmoi"          # dotfiles manager
brew "mas"              # Mac App Store CLI

# ─────────────────────────────────────────────
# CLI TOOLS — Shell & Terminal
# ─────────────────────────────────────────────
brew "fzf"
brew "ripgrep"          # fast grep (rg)
brew "eza"              # modern ls
brew "yazi"             # TUI file manager
brew "btop"             # resource monitor
brew "neofetch"
brew "tmux"
brew "pure"

# ─────────────────────────────────────────────
# FONTS
# ─────────────────────────────────────────────
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-hack-nerd-font"

# ─────────────────────────────────────────────
# GUI APPS — Security & Identity
# ─────────────────────────────────────────────
cask "yubico-authenticator"

# ─────────────────────────────────────────────
# GUI APPS — Browsers
# ─────────────────────────────────────────────
cask "firefox"
cask "google-chrome"
cask "zen"

# ─────────────────────────────────────────────
# GUI APPS — Productivity
# ─────────────────────────────────────────────
cask "raycast"

# ─────────────────────────────────────────────
# GUI APPS — Development
# ─────────────────────────────────────────────
cask "ghostty"
cask "zed"
cask "visual-studio-code"
cask "jetbrains-toolbox"
cask "orbstack"
cask "gitkraken"
cask "mongodb-compass"
cask "bruno"
cask "dotnet-sdk"

# ─────────────────────────────────────────────
# GUI APPS — Communication & Media
# ─────────────────────────────────────────────
cask "discord"
cask "proton-mail"
cask "spotify"

# ─────────────────────────────────────────────
# GUI APPS — Cloud & Sync
# ─────────────────────────────────────────────
cask "insync"

# ─────────────────────────────────────────────
# GUI APPS — System Utilities
# ─────────────────────────────────────────────

# ─────────────────────────────────────────────
# APP STORE
# ─────────────────────────────────────────────
mas "Amphetamine", id: 937984704
mas "AutoMounter", id: 1160435653
mas "Tailscale", id: 1475387142
mas "Infuse 7", id: 1136220934
