# Brewfile — fearful (Maximiliano Falicoff)
# Generated from nix-darwin config, April 2026
# Usage: brew bundle --file=Brewfile

tap "homebrew/services"
tap "homebrew/cask-fonts"

# ─────────────────────────────────────────────
# CLI TOOLS — Language Runtimes
# ─────────────────────────────────────────────
brew "node"
brew "go"
brew "bun"
brew "uv"               # fast Python package manager

# ─────────────────────────────────────────────
# CLI TOOLS — Infrastructure & Cloud
# ─────────────────────────────────────────────
brew "terraform"
brew "pulumi"
brew "azure-cli"
brew "kubectl"
brew "k9s"              # Kubernetes TUI
brew "kubeseal"         # Sealed Secrets

# ─────────────────────────────────────────────
# CLI TOOLS — Developer Tools
# ─────────────────────────────────────────────
brew "git"
brew "git-delta"        # beautiful diffs (used by git as pager)
brew "git-lfs"
brew "git-filter-repo"
brew "lazygit"          # TUI git client
brew "lazydocker"       # Docker TUI
brew "just"             # command runner
brew "jq"               # JSON processor
brew "direnv"           # per-directory env vars
brew "age"              # modern file encryption
brew "sops"             # secrets manager
brew "opencode"         # AI coding agent
brew "chezmoi"          # dotfiles manager
brew "mas"              # Mac App Store CLI

# ─────────────────────────────────────────────
# CLI TOOLS — Shell & Terminal
# ─────────────────────────────────────────────
brew "fzf"
brew "ripgrep"          # fast grep (rg)
brew "eza"              # modern ls
brew "yazi"             # TUI file manager
brew "btop"             # resource monitor
brew "neofetch"
brew "tmux"

# ─────────────────────────────────────────────
# FONTS
# ─────────────────────────────────────────────
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-hack-nerd-font"

# ─────────────────────────────────────────────
# GUI APPS — Security & Identity
# ─────────────────────────────────────────────
cask "1password"
cask "1password-cli"
cask "yubico-authenticator"

# ─────────────────────────────────────────────
# GUI APPS — Browsers
# ─────────────────────────────────────────────
cask "firefox"
cask "google-chrome"
cask "zen"

# ─────────────────────────────────────────────
# GUI APPS — Productivity
# ─────────────────────────────────────────────
cask "raycast"
cask "affine"

# ─────────────────────────────────────────────
# GUI APPS — Development
# ─────────────────────────────────────────────
cask "ghostty"
cask "zed"
cask "jetbrains-toolbox"
cask "orbstack"
cask "gitkraken"
cask "mongodb-compass"
cask "yaak"
cask "bruno"
cask "dotnet-sdk"

# ─────────────────────────────────────────────
# GUI APPS — Communication & Media
# ─────────────────────────────────────────────
cask "discord"
cask "proton-mail"
cask "spotify"
cask "calibre"

# ─────────────────────────────────────────────
# GUI APPS — Cloud & Sync
# ─────────────────────────────────────────────
cask "insync"
cask "opencloud"

# ─────────────────────────────────────────────
# GUI APPS — System Utilities
# ─────────────────────────────────────────────
cask "only-switch"
cask "stats"
cask "android-file-transfer"
cask "vmware-fusion"
cask "garmin-express"

# ─────────────────────────────────────────────
# APP STORE
# ─────────────────────────────────────────────
mas "Amphetamine", id: 937984704
mas "AutoMounter", id: 1160435653
mas "Tailscale", id: 1475387142
mas "Infuse 7", id: 1136220934
mas "Windows App", id: 1295203466
